## LAB - S04-L003-Dodawanie i usuwanie wierszy

1. Zaimportuj moduł pandas i numpy, nadaj im standardowe aliasy. Do zmiennej professions wczytaj zawartość pliku Prestige.csv. Wyświetl nagłówek obiektu data frame.
2. Zdefiniuj słownik w zmiennej dict, który ma klucze takie, jak nazwy kolumn w professions. Wpisz do wartości dla klucza name - [data scientist], pozostałe wartości zdefiniuj jako [NaN]. Wyświetl obiekt w celu weryfikacji.
3. Dodaj do professions nowy wiersz zdefiniowany przez słownik dict. W celu weryfikacji wyświetl 5 ostatnich wartości z professions
4.  Odszukaj w professions wiersza, w którym name to taxi.drivers. Zapisz go do zmiennej taxi i wyświetl.
5.  Usuń z professions wiersz z indekstem 98 (to właśnie taxi.drivers). Wyświetl 5 ostatnich wartości z professions
6. Dodaj wiersz znajdujący się w taxi do professions, w taki sposób, aby wiersz na stałe znajdował sie w zmiennej professions. Wyświetl ostatnich 5 wierszy *professions w celu weryfikacji
7. Usuń z professions kolumnę census
8. Usuń z professions kolumnę type. Wykorzystaj do tego inną metodę niż wykorzystana w poprzednim zadaniu

In [1]:
import pandas as pd
import numpy as np

In [2]:
professions = pd.read_csv('../zasoby/Prestige.csv')
professions.head()

                  name  education  income  women  prestige  census  type
0   gov.administrators      13.11   12351  11.16      68.8    1113  prof
1     general.managers      12.26   25879   4.02      69.1    1130  prof
2          accountants      12.77    9271  15.70      63.4    1171  prof
3  purchasing.officers      11.42    8865   9.11      56.8    1175  prof
4             chemists      14.62    8403  11.68      73.5    2111  prof

In [3]:
dict = {"name": ["data scientist"], "education": [np.NaN], "income": [np.NaN], "women": [np.NaN], "prestige": [np.NaN], "census": [np.NaN], "type": [np.NaN]}

In [4]:
dict

{'name': ['data scientist'],
 'education': [nan],
 'income': [nan],
 'women': [nan],
 'prestige': [nan],
 'census': [nan],
 'type': [nan]}

In [20]:
professions = pd.concat([professions, pd.DataFrame(dict)], ignore_index=True)

In [23]:
professions.tail()

               name  education  income  women  prestige  census type
100     typesetters      10.00  6462.0  13.58      42.2  9511.0   bc
101     bookbinders       8.55  3617.0  70.87      35.2  9517.0   bc
102  data scientist        NaN     NaN    NaN       NaN     NaN  NaN
103  data scientist        NaN     NaN    NaN       NaN     NaN  NaN
104  data scientist        NaN     NaN    NaN       NaN     NaN  NaN

In [26]:
taxi = professions.query('name == "taxi.drivers"')

In [27]:
taxi

            name  education  income  women  prestige  census type
98  taxi.drivers       7.93  4224.0   3.59      25.1  9173.0   bc

In [31]:
professions.drop(98, inplace=True)

In [32]:
professions.tail(10)

                       name  education   income  women  prestige  census  type
94   construction.labourers       7.52   3910.0   1.09      26.5  8798.0    bc
95                   pilots      12.27  14032.0   0.58      66.1  9111.0  prof
96          train.engineers       8.49   8845.0   0.00      48.9  9131.0    bc
97              bus.drivers       7.58   5562.0   9.47      35.9  9171.0    bc
99             longshoremen       8.37   4753.0   0.00      26.1  9313.0    bc
100             typesetters      10.00   6462.0  13.58      42.2  9511.0    bc
101             bookbinders       8.55   3617.0  70.87      35.2  9517.0    bc
102          data scientist        NaN      NaN    NaN       NaN     NaN   NaN
103          data scientist        NaN      NaN    NaN       NaN     NaN   NaN
104          data scientist        NaN      NaN    NaN       NaN     NaN   NaN

In [33]:
professions = pd.concat([professions, taxi])

In [34]:
professions.tail(10)

                name  education   income  women  prestige  census  type
95            pilots      12.27  14032.0   0.58      66.1  9111.0  prof
96   train.engineers       8.49   8845.0   0.00      48.9  9131.0    bc
97       bus.drivers       7.58   5562.0   9.47      35.9  9171.0    bc
99      longshoremen       8.37   4753.0   0.00      26.1  9313.0    bc
100      typesetters      10.00   6462.0  13.58      42.2  9511.0    bc
101      bookbinders       8.55   3617.0  70.87      35.2  9517.0    bc
102   data scientist        NaN      NaN    NaN       NaN     NaN   NaN
103   data scientist        NaN      NaN    NaN       NaN     NaN   NaN
104   data scientist        NaN      NaN    NaN       NaN     NaN   NaN
98      taxi.drivers       7.93   4224.0   3.59      25.1  9173.0    bc

In [36]:
professions.drop(columns=['census'], inplace=True)

In [37]:
del professions['type']